YaroslavTrymbach/ChargeStation/Stm32/ChargeStationCentralCPU/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2018 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"
#include "cmsis_os.h"
#include "lwip.h"
#include "usb_device.h"

/* USER CODE BEGIN Includes */

#include "display.h"
#include "RFID.h"
#include "rc522.h"
#include "channel.h"
#include "tasks.h"
//#include "usbd_cdc_if.h"
#include "settings.h"
#include "rng.h"
#include "serial_control.h"
#include "chargePointTime.h"
#include "net.h"
#include "netConn.h"
#include "ocpp.h"
#include "ocppConfiguration.h"
#include "ocppConfigurationDef.h"
#include "connector.h"
#include "chargePoint.h"
#include "indication.h"
#include "localAuthList.h"
#include "chargePointState.h"

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c2;
DMA_HandleTypeDef hdma_i2c2_rx;
DMA_HandleTypeDef hdma_i2c2_tx;

RNG_HandleTypeDef hrng;

RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi4;

UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;
DMA_HandleTypeDef hdma_usart2_tx;

osThreadId defaultTaskHandle;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

QueueHandle_t mainQueue;
uint8_t str[16];
uint32_t lastUserButtonPressTick = 0;
ChargePointSetting *settings;
bool isNeedSetTime = true;
idToken lastCheckedTagId;
uint32_t lastCheckedTagTick = 0;

OcppConfigurationVaried ocppConfVaried;
OcppConfigurationFixed ocppConfFixed;
OcppConfigurationRestrict ocppConfRestrict;
ChargePointConnector connector[CONFIGURATION_NUMBER_OF_CONNECTORS];

bool remoteStartTransactionProcessing = false;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_I2C2_Init(void);
static void MX_SPI4_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_RNG_Init(void);
static void MX_RTC_Init(void);
void StartDefaultTask(void const * argument);

/* USER CODE BEGIN PFP */
#define PACK_TO_PARAM_BYTE0(param, value) param |= (value & 0xFF)
#define PACK_TO_PARAM_BYTE1(param, value) param |= ((value & 0xFF) << 8)
#define PACK_TO_PARAM_BYTE2(param, value) param |= ((value & 0xFF) << 16)
#define PACK_TO_PARAM_BYTE3(param, value) param |= ((value & 0xFF) << 24)

/* USER CODE END PFP */

#define CAP_CARD_DECLINED "CARD DECLINED"
#define CAP_CARD_ACCEPTED "CARD ACCEPTED"
#define MES_NO_CONNECTION "NO CONNECTION"

/* USER CODE BEGIN 0 */


void initDisplay(){
	Display_init(&hi2c2);
	
	Display_PrintStrCenter(0, "Starting\0");
	Display_PrintStrCenter(1, "Hardware checking\0");
}

void initConnectors(){
	int i;
	for(i = 0; i < CONFIGURATION_NUMBER_OF_CONNECTORS; i++){
		connector[i].id = i + 1;
		connector[i].address = i + 1;
		connector[i].status = CHARGE_POINT_STATUS_UNKNOWN;
		connector[i].online = false;
		connector[i].meterValue = 0;
		connector[i].isMeterValueSet = false;
		connector[i].isMeterValueRequest = true;
		connector[i].pilotSygnalLevel = PILOT_SYGNAL_LEVEL_F;
		connector[i].pilotSygnalPwm = PILOT_SYGNAL_PWM_UNKNOWN;
		connector[i].noAnswerCnt = 0;
		
