YaroslavTrymbach/ChargeStation/Stm32/ChargeStationCentralCPU/Src/main.c
			strcpy(conn->userTagId, tagId);
			conn->chargeTransaction.startMeterValue = conn->meterValue;
	    conn->chargeTransaction.isActive = true;
	    conn->chargeTransaction.isClosed = false;
	
			if(cpState_isServerOnline()){
				netMessage.messageId = NET_INPUT_MESSAGE_START_TRANSACTION;
				netMessage.param1 = (int)conn;
				NET_sendInputMessage(&netMessage);
			}
	
	    Channel_startCharging(i);
			
			return;
		}
	}
}

void stopChargeTransaction(int channel){
	ChargePointConnector *conn;
	NetInputMessage netMessage;
	
	conn = &connector[channel];
	conn->chargeTransaction.isClosed = true;
	conn->chargeTransaction.stopMeterValue = conn->meterValue;
	
	netMessage.messageId = NET_INPUT_MESSAGE_STOP_TRANSACTION;
	netMessage.param1 = (int)conn;
	NET_sendInputMessage(&netMessage);
}

void sendUnlockConnectorAnswer(int status, int uniqIdIndex){
	NetInputMessage netMessage;
	netMessage.messageId = NET_INPUT_MESSAGE_UNLOCK_CONNECTOR_ANSWER;
	netMessage.param1 = status;
	netMessage.uniqIdIndex = uniqIdIndex;
	NET_sendInputMessage(&netMessage);
}



void acceptAuth(idToken tagId, bool success){
	char s[32];
	sprintf(s, "Authorize %s", success ? "SUCCESS" : "FAILED");
	printf("%s\n", s);
	Indication_ShowMessage(s, NULL, 5000);	
	
	if(success){
		startChargeTransaction(tagId, -1);
	}
}

void makeReboot(void){
	HAL_NVIC_SystemReset();
}

void processChannelFullCycleNotify(int reason){
	if(reason == FULL_CYCLE_NOTIFY_REASON_REBOOT){
		makeReboot();
	}
}

void processEnabledTag(idToken cardId){
	NetInputMessage netMessage;
	char s[32];
	bool needNetworkCheck = false;
	
	printf("CardId %s\n", cardId);
		
	if((strncmp(cardId, lastCheckedTagId, ID_TOKEN_SIZE) == 0) && ((HAL_GetTick() - lastCheckedTagTick) < 5000))
		return;
	strcpy(lastCheckedTagId, cardId);
	lastCheckedTagTick = HAL_GetTick();
	
	sprintf(s, "CardId %s", cardId);
	Indication_ShowMessage("Card discovered", s, 5000);
				
	if(checkChargeTransactionByTag(cardId))
		return;
	
	if(cpState_isServerOnline()){
		if(ocppConfVaried.localPreAuthorize){
			if(!checkTagInLocalAuthList(cardId))
				needNetworkCheck = true;
		}
		else{
			needNetworkCheck = true;
		}
	}
	else{
		if((!ocppConfVaried.localAuthorizeOffline) || (!checkTagInLocalAuthList(cardId)) ){
				Indication_ShowMessage(CAP_CARD_DECLINED, MES_NO_CONNECTION, 5000);
				return;
		}
	}
	
	if(needNetworkCheck){
		netMessage.messageId = NET_INPUT_MESSAGE_AUTHORIZE;
		strcpy(netMessage.tagId, cardId);
		NET_sendInputMessage(&netMessage);
	}
	else{
		// Just start charging
		startChargeTransaction(cardId, -1);
		Indication_ShowMessage(CAP_CARD_ACCEPTED, NULL, 5000);
	}
}

void sendRemoteStartTransactionAnswer(int status, int uniqIdIndex){
	NetInputMessage netMessage;
	netMessage.messageId = NET_INPUT_MESSAGE_REMOTE_START_TRANSACTION_ANSWER;
	netMessage.param1 = status;
	netMessage.uniqIdIndex = uniqIdIndex;
	NET_sendInputMessage(&netMessage);
}

void sendRemoteStopTransactionAnswer(int status, int uniqIdIndex){
	NetInputMessage netMessage;
	netMessage.messageId = NET_INPUT_MESSAGE_REMOTE_STOP_TRANSACTION_ANSWER;
	netMessage.param1 = status;
	netMessage.uniqIdIndex = uniqIdIndex;
	NET_sendInputMessage(&netMessage);
}


void remoteStartTransaction(GeneralMessage *message){
	bool authRemoteTxRequests;
	int uniqIdIndex;
	int connectorId;
	idToken idTag;
	
	connectorId = message->param1;
	uniqIdIndex = message->param2;
	
	if(remoteStartTransactionProcessing || (connectorId < 0) || (connectorId > CONFIGURATION_NUMBER_OF_CONNECTORS)) {
		//Previous operation is not processed yet or invalid connector Id
		//reject new operation
		sendRemoteStartTransactionAnswer(REMOTE_STARTSTOP_STATUS_REJECTED, uniqIdIndex);
		return;
	}
		
	
	authRemoteTxRequests = ocppConfRestrict.authorizeRemoteTxRequestsReadOnly ? ocppConfFixed.authorizeRemoteTxRequests:  ocppConfVaried.authorizeRemoteTxRequests;
	if(authRemoteTxRequests){
		
	}
	
	strcpy(idTag, message->tokenId);
	sendRemoteStartTransactionAnswer(REMOTE_STARTSTOP_STATUS_ACCEPTED, uniqIdIndex);
	startChargeTransaction(idTag, connectorId - 1); 
}

void remoteStopTransaction(GeneralMessage *message){
	int uniqIdIndex;
	int transactionId;
	bool taIsFound;
	ChargePointConnector *conn;
	int i;
	
	transactionId = message->param1;
	uniqIdIndex = message->param2;
	
	taIsFound = false;
	for(i = 0; i < CONFIGURATION_NUMBER_OF_CONNECTORS; i++){
		conn = &connector[i];
		if((conn->chargeTransaction.id == transactionId) && conn->chargeTransaction.isActive){
			taIsFound = true;
			break;
		}
	}
	
	if(taIsFound){
		sendRemoteStopTransactionAnswer(REMOTE_STARTSTOP_STATUS_ACCEPTED, uniqIdIndex);
		Indication_ShowMessage("Remote finish", "of charging", 2000);
		conn->chargeTransaction.stopReason = OCPP_REASON_REMOTE;
		Channel_haltCharging(i);
		//stopChargeTransaction(i);
	}
	else{
		sendRemoteStopTransactionAnswer(REMOTE_STARTSTOP_STATUS_REJECTED, uniqIdIndex);
	}
}



void remoteReset(GeneralMessage *message){
	int resetType;
	int i;
	ChargePointConnector *conn;

	resetType = message->param1;
	
	/*if(resetType == RESET_TYPE_HARD){
		resetStatus = OCPP_RESET_STATUS_ACCEPTED;
	}*/
	
	for(i = 0; i < CONFIGURATION_NUMBER_OF_CONNECTORS; i++){
		conn = &connector[i];
		conn->isNeedReset = true;
	}
	
	Channel_requestFullCycleNotify(FULL_CYCLE_NOTIFY_REASON_REBOOT);
	
	//makeReboot();
}

void processMessageFromNET(GeneralMessage *message){
	NetInputMessage netMessage;
	printf("Main task. Message from NET is got\n");
	char s[32];
	switch(message->messageId){
		case MESSAGE_NET_SERVER_ACCEPT:
			sprintf(s, "Station %s", message->param1 ? "ACCEPTED" : "REJECTED");
		  Indication_ShowMessage(s, NULL, 5000);
		
		  if(NET_is_station_accepted()){
				//When station is accepted. It is need to send charge point status to server
				netMessage.messageId = NET_INPUT_MESSAGE_SEND_CHARGE_POINT_STATUS;
				NET_sendInputMessage(&netMessage);
			}
			cpState_setServerOnline(NET_is_station_accepted());
			break;
		case MESSAGE_NET_AUTHORIZE:
			acceptAuth(message->tokenId, message->param1);
			break;
		case MESSAGE_NET_UNLOCK_CONNECTOR:
			Channel_unlockConnector(message->param1 - 1, message->param2);
			break;
		case MESSAGE_NET_REMOTE_START_TRANSACTION:
			remoteStartTransaction(message);
			break;
		case MESSAGE_NET_REMOTE_STOP_TRANSACTION:
			remoteStopTransaction(message);
			break;
		case MESSAGE_NET_RESET:
			remoteReset(message);
			break;
	}
}

void onChannelStatusChanged(ChargePointConnector *conn){
	NetInputMessage netMessage;
	
	//If connection with server is present it is need to send new status 
	if(NET_is_station_accepted()){
		netMessage.messageId = NET_INPUT_MESSAGE_SEND_CONNECTOR_STATUS;
		netMessage.param1 = 0;
		PACK_TO_PARAM_BYTE0(netMessage.param1, conn->id);
		PACK_TO_PARAM_BYTE1(netMessage.param1, conn->status);
		PACK_TO_PARAM_BYTE2(netMessage.param1, CHARGE_POINT_ERROR_CODE_NO_ERROR);
		NET_sendInputMessage(&netMessage);
	}
	
