YaroslavTrymbach/ChargeStation/Stm32/ChargeStationCentralCPU/Src/main.c
	switch(conn->status){
		case CHARGE_POINT_STATUS_AVAILABLE:
			strcpy(conn->userTagId, "");
      strcpy(lastCheckedTagId, "");		
			break;
		case CHARGE_POINT_STATUS_CHARGING:
			strcpy(lastCheckedTagId, "");	
			break;
		case CHARGE_POINT_STATUS_SUSPENDED_EV:
			conn->isMeterValueRequest = true;
			break;
	}
	Indication_PrintChannel(conn->id - 1, conn);
}

void finishUnlockConnector(GeneralMessage *message){
	int uniqIdIndex;
	int status;
	ChargePointConnector *conn;
	
	conn = (ChargePointConnector*)message->param1;
	uniqIdIndex = conn->uniqMesIndUnlockConnector;
	
	status = conn->isLocked ? UNLOCK_STATUS_UNLOCK_FAILED : UNLOCK_STATUS_UNLOCKED;
	
	sendUnlockConnectorAnswer(status, uniqIdIndex);
	
	if((!conn->isLocked) && conn->chargeTransaction.isActive){
		//It is need to close transaction
		conn->status = CHARGE_POINT_STATUS_FINISHING;
		conn->isMeterValueRequest = true; //Need request meterValue for close transaction
		conn->chargeTransaction.stopReason = OCPP_REASON_UNLOCK_COMMAND;
		conn->chargeTransaction.isActive = false;
		onChannelStatusChanged(conn);
	}
}

void processMessageFromChannels(GeneralMessage *message){
	int connIndex;
	ChargePointConnector *conn;
	
	switch(message->messageId){
		case MESSAGE_CHANNEL_STATUS_CHANGED:
			connIndex = message->param1;
		  conn = &connector[connIndex];
			onChannelStatusChanged(conn);
			break;
		case MESSAGE_CHANNEL_CHARGING_HALTED:
			connIndex = message->param1;
		  conn = &connector[connIndex];
		  conn->status = CHARGE_POINT_STATUS_FINISHING;
		  conn->isMeterValueRequest = true; //Need request meterValue for close transaction
		  conn->chargeTransaction.isActive = false;
		  onChannelStatusChanged(conn);
			break;
		case MESSAGE_CHANNEL_GET_METER_VALUE:
			connIndex = message->param1;
		  conn = &connector[connIndex];
		  if(conn->chargeTransaction.isActive){
				//Need update screen
				Indication_PrintChannel(conn->id - 1, conn);
			}
			else{
				if(!conn->chargeTransaction.isClosed){
					//CloseTransaction
					stopChargeTransaction(connIndex);
				}
			}
			break;
		case MESSAGE_CHANNEL_UNLOCK_CONNECTOR:
			finishUnlockConnector(message);
			break;
		case MESSAGE_CHANNEL_FULL_CYCLE_NOTIFY:
			processChannelFullCycleNotify(message->param1);
			break;	
	}
}

void processMessageFromRFID(GeneralMessage *message){

	NetInputMessage netMessage;
	idToken tagId;
	
	printf("Main task. Message from RFID is got\n");
	switch(message->messageId){
		case MESSAGE_RFID_FOUND_CARD:
			sprintf(tagId, "%.8X", message->param1);
			processEnabledTag(tagId);
			break;
		case MESSAGE_RFID_CONNECTION:
			if(message->param1){
				//Connected
				ChargePoint_setRFIDEnabled(true);
			}
			else{
				//Disconnected
				ChargePoint_setRFIDEnabled(false);
			}
			netMessage.messageId = NET_INPUT_MESSAGE_SEND_CHARGE_POINT_STATUS;
			NET_sendInputMessage(&netMessage);
			break;
	}
}

void processMessageFromSerialControl(GeneralMessage *message){
	printf("Main task. Message from SerialControl is got\n");
	ChargePointSetting* st;	
	switch(message->messageId){
		case MESSAGE_SER_CONTROL_SET_LOCAL_IP:
			NET_changeLocalIp();
			break;
		case MESSAGE_SER_CONTROL_SET_SERVER_HOST:
			st = Settings_get();
			NET_CONN_setRemoteHost(st->serverHost);
			break;
		case MESSAGE_SER_CONTROL_SET_SERVER_PORT:
			st = Settings_get();
			NET_CONN_setRemotePort(st->serverPort);
			break;
	}
}

void testSaveSetting(){
	printf("testSaveSetting\n");
	sprintf(settings->ChargePointId, "SaveCP_%.8X", generateRnd32());
	printf("New ChargePointID: %s\n", settings->ChargePointId);
	if(Settings_save())
		printf("Setting saving is success\n");
	else
		printf("Setting saving is failed\n");
}

void testReconnect(){
	NetInputMessage mes;
	mes.messageId = NET_INPUT_MESSAGE_RECONNECT;
	NET_sendInputMessage(&mes);
}

void printCurrentDateTime(){
	struct tm dt;
	
	if(isNeedSetTime){
		dt.tm_mday = 11;
		dt.tm_mon = 7;
		dt.tm_year = 2018;
	
		dt.tm_hour = 15;
		dt.tm_min = 41;
		dt.tm_sec = 39;
	
		setCurrentTime(&dt);
		
		isNeedSetTime = false;
	}
	else{
		getCurrentTime(&dt);
		printf("DateTime: %.2d.%.2d.%.4d %.2d:%.2d:%.2d\n", dt.tm_mday, dt.tm_mon, dt.tm_year, dt.tm_hour, dt.tm_min, dt.tm_sec);
	}
}

void updateMeterValues(void){
	int i;
	ChargePointConnector *conn;
	
	for(i = 0; i < CONFIGURATION_NUMBER_OF_CONNECTORS; i++){
			conn = &connector[i];
			if(conn->status == CHARGE_POINT_STATUS_CHARGING){
				conn->isMeterValueRequest = true;
			}
	}
}

void mainDispatcher(void){
	uint32_t currentTick, lastLedTick;
	uint32_t lastSendTick, lastMeterReqTick;
	char sendData[16];
	GeneralMessage message;
	uint32_t btnPressCnt = 0;
	
	ChargePoint_init();
	
	Settings_init();
	settings = Settings_get();
	printf("ChargePointID: %s\n", settings->ChargePointId);
	
	localAuthList_load();
	
	fillOcppConfigurationWithDefValues(&ocppConfVaried, &ocppConfFixed, &ocppConfRestrict);
	
	
	
	initDisplay();
	initConnectors();
	checkHardware();
	
	Display_clear();
	Indication_Init(connector);
	
	if(ChargePoint_getStatusState() != CHARGE_POINT_STATUS_FAULTED){
		ChargePoint_setStatusState(CHARGE_POINT_STATUS_AVAILABLE, 0, NULL);
	}
	
	Channel_start(TASK_TAG_CHANNELS, mainQueue, connector, CONFIGURATION_NUMBER_OF_CONNECTORS);
	
	RFID_start(TASK_TAG_RFID, mainQueue);
	SerialControl_start(TASK_TAG_SERIAL_CONTROL, mainQueue);
	NET_start(TASK_TAG_NET, mainQueue);
	
	Display_PrintStrCenter(0, "Waiting\0");
	
	lastLedTick = HAL_GetTick(); 
	lastSendTick = lastLedTick;
	lastMeterReqTick = lastLedTick;
	
	// Infinite loop 
  for(;;)
  {
		
		while(xQueueReceive(mainQueue, &message, 0) == pdPASS){
			switch(message.sourceTag){
				case TASK_TAG_RFID:
					processMessageFromRFID(&message);
					break;
				case TASK_TAG_USER_BUTTON:
					//printf("User button is pressed %d\n", ++btnPressCnt);
				  //testSaveSetting();
				  //printCurrentDateTime();
				  NET_test();
				  //testReconnect();
					break;
				case TASK_TAG_SERIAL_CONTROL:
					processMessageFromSerialControl(&message);
					break;
				case TASK_TAG_NET:
					processMessageFromNET(&message);
					break;
				case TASK_TAG_CHANNELS:
					processMessageFromChannels(&message);
					break;
			}
			
